package migrations

import (
	"database/sql"

	"github.com/pressly/goose"
)

func init() {
	goose.AddMigration(upInitData, downInitData)
}

func upInitData(tx *sql.Tx) error {
	_, err := tx.Exec(`
INSERT INTO patient (id, first_name, last_name, policy_number, tel) 
VALUES 
       (0, 'Иван', 'Иванов', '1111111111111111', '+79196853269'),
	   (1, 'Людмила', 'Хорошова', '222', '+79196653869'),
       (2, 'Даниил', 'Огурцов', '333', '+79996853277'),
       (3, 'Василий', 'Попов', '44444', '+79556853856'),
       (4, 'Лола', 'Лоловна', '55', '+79777753856'),
       (5, 'Ирина', 'Абрамова', '66666666666', '+79885697856'),
       (6, 'Владимир', 'Петров', '7878455656', '+79125844788');
       
INSERT INTO analysis (id, name, icd_code) 
VALUES 
       (0, 'Общий анализ мочи', 'N20-N23'),
	   (1, 'Общий анализ крови', 'N20-N23'),
       (2, 'УЗИ почек', 'N20-N23'),
       (3, 'Глюкоза (кровь на сахар)', 'E10-E14'),
       (4, 'Гликированный (гликозилированный) гемоглобин', 'E10-E14'),
       (5, 'Фруктозамин', 'E10-E14'),
       (6, 'Гастроскопия', 'K29'),
       (7, 'Исследование желудочного сока', 'K29');

INSERT INTO direction (id, patient_id, date, icd_code, medical_organization) 
VALUES 
       (0, 0, '2020-11-13 12:00', 'K29', 'Поликлиника №5'),
	   (1, 1, '2020-11-13 12:30', 'E10-E14', 'Поликлиника №6'),
       (2, 2, '2020-11-13 14:00', 'N20-N23', 'Поликлиника №1'),
       (3, 3, '2020-11-15 10:00', 'K29', 'Поликлиника №6'),
       (4, 4, '2020-11-15 11:15', 'E10-E14', 'Поликлиника №5'),
       (5, 5, '2020-11-14 14:00', 'N20-N23', 'Поликлиника №1'),
       (6, 6, '2020-11-13 15:00', 'E10-E14', 'Поликлиника №5');

INSERT INTO direction_analysis (id, analysis_id, direction_id) 
VALUES 
       (0, 6, 0),
       (1, 7, 0),
       (2, 3, 1),
       (3, 4, 1),
       (4, 5, 1),
       (5, 0, 2),
       (6, 1, 2),
       (7, 2, 2),
       
       (8, 6, 3),
       (9, 7, 3),
       (10, 3, 4),
       (11, 4, 4),
       (12, 5, 4),
       (13, 0, 5),
       (14, 1, 5),
       (15, 2, 5),
       
       (16, 3, 6),
       (17, 4, 6),
       (18, 5, 6);
`)
	return err
}

func downInitData(tx *sql.Tx) error {
	// This code is executed when the migration is rolled back.
	return nil
}
