package migrations

import (
	"database/sql"

	"github.com/pressly/goose"
)

func init() {
	goose.AddMigration(upInitData, downInitData)
}

func upInitData(tx *sql.Tx) error {
	_, err := tx.Exec(`
INSERT INTO patient (id, first_name, last_name, birth_date, policy_number, tel) 
VALUES 
       (0, 'Иван', 'Иванов', '1999-01-08', '1111111111111111', '+79196853269'),
	   (1, 'Людмила', 'Хорошова', '1998-02-09', '222', '+79196653869'),
       (2, 'Даниил', 'Огурцов', '1997-03-10', '333', '+79996853277'),
       (3, 'Василий', 'Попов', '1996-04-11', '44444', '+79556853856'),
       (4, 'Лола', 'Лоловна', '1995-05-12', '55', '+79777753856'),
       (5, 'Ирина', 'Абрамова', '1994-06-13', '66666666666', '+79885697856'),
       (6, 'Владимир', 'Петров', '1993-06-14', '7878455656', '+79125844788');
       
INSERT INTO analysis (id, name) 
VALUES 
       (0, 'Общий анализ мочи'),
	   (1, 'Общий анализ крови'),
       (2, 'УЗИ почек'),
       (3, 'Глюкоза (кровь на сахар)'),
       (4, 'Гликированный (гликозилированный) гемоглобин'),
       (5, 'Фруктозамин'),
       (6, 'Гастроскопия'),
       (7, 'Исследование желудочного сока');

INSERT INTO doctor (id, name, specialty) 
VALUES 
       (0, 'Бок А.В.', 'Гастроэнтеролог'),
	   (1, 'Медведев С.И.', 'Эндокринолог'),
       (2, 'Коренёв Г.О.', 'Нефролог');

INSERT INTO direction (id, patient_id, doctor_id, date, icd_code, medical_organization, organization_contact, justification) 
VALUES 
       (0, 0, 0, '2020-11-13 12:00', 'K29', 'Поликлиника №5', '№5@mail.ru', 'Направление к специалисту из поликлиники №5'),
	   (1, 1, 1, '2020-11-13 12:30', 'E10-E14', 'Поликлиника №6', '№6mail.ru', 'Направление к специалисту из поликлиники №6'),
       (2, 2, 2, '2020-11-13 14:00', 'N20-N23', 'Поликлиника №1', '№1mail.ru', 'Направление к специалисту из поликлиники №1'),
       (3, 3, 0, '2020-11-15 10:00', 'K29', 'Поликлиника №6', '№6mail.ru', 'Направление к специалисту из поликлиники №6'),
       (4, 4, 1, '2020-11-15 11:15', 'E10-E14', 'Поликлиника №5', '№5mail.ru', 'Направление к специалисту из поликлиники №5'),
       (5, 5, 2, '2020-11-14 14:00', 'N20-N23', 'Поликлиника №1', '№1mail.ru', 'Направление к специалисту из поликлиники №1'),
       (6, 6, 1, '2020-11-13 15:00', 'E10-E14', 'Поликлиника №5', '№5mail.ru', 'Направление к специалисту из поликлиники №5');

INSERT INTO direction_analysis (id, analysis_id, direction_id) 
VALUES 
       (0, 6, 0),
       (1, 7, 0),
       (2, 3, 1),
       (3, 4, 1),
       (4, 5, 1),
       (5, 0, 2),
       (6, 1, 2),
       (7, 2, 2),
       
       (8, 6, 3),
       (9, 7, 3),
       (10, 3, 4),
       (11, 4, 4),
       (12, 5, 4),
       (13, 0, 5),
       (14, 1, 5),
       (15, 2, 5),
       
       (16, 3, 6),
       (17, 4, 6),
       (18, 5, 6);
`)
	return err
}

func downInitData(tx *sql.Tx) error {
	// This code is executed when the migration is rolled back.
	return nil
}
